app/controllers/meetings_controller.rb

SELECT `meetings`.* FROM `meetings` WHERE (meets_on <= CURRENT_TIMESTAMP()) ORDER BY meets_on
---
  def index
   @search = Meeting.search do

INSERT INTO `meetings` (`created_at`, `description`, `location`, `meets_on`, `updated_at`) VALUES ('2012-06-27 15:02:44', 'Independence Day celebration', 'Bear Lake', '2012-07-04', '2012-06-27 15:02:44')
---
  def create
    @meeting = Meeting.new(params[:meeting])
	  if @meeting.save

SELECT `meetings`.* FROM `meetings` WHERE `meetings`.`id` = 2 LIMIT 1
---
  def show
    @meeting = Meeting.find(params[:id])

SELECT `meetings`.* FROM `meetings` WHERE `meetings`.`id` = 2 LIMIT 1
---
  def edit
    @meeting = Meeting.find(params[:id])

SELECT `meetings`.* FROM `meetings` WHERE `meetings`.`id` = 2 LIMIT 1
UPDATE `meetings` SET `description` = 'gALACTIC conference', `updated_at` = '2012-06-27 20:22:51' WHERE `meetings`.`id` = 2
---
  def update
    @meeting = Meeting.find(params[:id])
    if @meeting.update_attributes(params[:meeting])

SELECT `meetings`.* FROM `meetings` WHERE `meetings`.`id` = 4 LIMIT 1
DELETE FROM `meetings` WHERE `meetings`.`id` = 4
---
  def destroy
    @meeting = Meeting.find(params[:id])
    @meeting.destroy

SELECT `meetings`.* FROM `meetings` WHERE `meetings`.`id` IN (980190963, 980190964)
---
  def find_meeting
    @meeting = Meeting.find(params[:id])